app/controllers/money_trackers_controller.rb

SELECT "money_trackers".* FROM "money_trackers" WHERE "money_trackers"."user_id" = 1 ORDER BY "money_trackers"."created_at" DESC
SELECT SUM("money_trackers"."amount") FROM "money_trackers" WHERE "money_trackers"."user_id" = 1 AND "money_trackers"."transaction_type" = 'Income'
SELECT SUM("money_trackers"."amount") FROM "money_trackers" WHERE "money_trackers"."user_id" = 1 AND "money_trackers"."transaction_type" = 'Expense'
---
    def index
      @money_trackers = current_user.money_trackers.order(created_at: :desc) # Fetch user-specific transactions
      @total_income = @money_trackers.where(transaction_type: "Income").sum(:amount)
      @total_expense = @money_trackers.where(transaction_type: "Expense").sum(:amount)

INSERT INTO "money_trackers" ("user_id", "amount", "transaction_type", "description", "created_at", "updated_at", "date") VALUES (1, 1000.0, 'Income', 'salary', '2024-12-25 08:17:46.753982', '2024-12-25 08:17:46.753982', '2024-12-25') RETURNING "id"
---
    def create
      @money_tracker = current_user.money_trackers.new(money_tracker_params)
      if @money_tracker.save